W6D5/cat_project/app/views/cat_rental_requests/new.html.erb

    <option selected>--Pick a cat--</option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"