W6D3/first_routes/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "brian@gmail.com"], ["updated_at", "2021-02-25 10:29:45.953738"], ["id", 5]]