W6D5/cat_project/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2021-03-02"], ["color", "Orange"], ["name", "adsf"], ["sex", "F"], ["created_at", "2021-03-08 19:15:27.634238"], ["updated_at", "2021-03-08 19:15:27.634238"]]
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["birth_date", "2021-03-03"], ["updated_at", "2021-03-08 19:29:19.277056"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)